import React from 'react';
import './Questions.css'

const Qustions = () => {
    return (
        <div>
            <div className='question'>
                <h1>1.How React Works?</h1>
                <p>Ans:  রিয়াক্ট মূলত আমাদের জন্য একটি ট্রি বজায় রাখে। এই ট্রি নোডগুলিতে দক্ষ ভিন্ন গণনা করতে সক্ষম।
                    আমাদের এইচটিএমএল কোডটিকে একটি ট্রি হিসাবে মনে করুন। আসলে, ব্রাউজারটি আপনার DOM (ব্রাউজারে আপনার রেন্ডার করা এইচটিএমএল) এর সাথে ঠিক কীভাবে আচরণ করে। প্রতিক্রিয়া আপনাকে কার্যকরভাবে জাভাস্ক্রিপ্টে আপনার DOM পুনঃনির্মাণ করতে এবং প্রকৃতপক্ষে ঘটে যাওয়া পরিবর্তনগুলিকে DOM-এ পুশ করতে দেয়।</p>
            </div>
            <div className='question'>
                <h1>2.Defferent Between Props vs State?</h1>
                <p>Ans:রিয়াক্ট স্টেট এবং প্রপস উভয়ই একটি উপাদানের মধ্যে ডেটা নিয়ন্ত্রণ করতে ব্যবহৃত হয়, সাধারণত প্রপস প্যারেন্ট দ্বারা সেট করা হয় এবং চাইল্ড উপাদানগুলিতে প্রেরণ করা হয় এবং সেগুলি সমগ্র উপাদান জুড়ে স্থির করা হয়। যে তথ্যর জন্য পরিবর্তন হতে যাচ্ছে , আমরা স্টেট ব্যবহার করি. এবং প্রপসগুলি অপরিবর্তনীয় যখন স্টেটগুলি পরিবর্তনযোগ্য ,আমারা যদি প্রপস পরিবর্তন করতে চায় তবে‍ আমরা প্যারেন্ট কম্পোনেন্ট থেকে করতে পারি, এবং তার পরে এটি চাইল্ড কম্পোনেন্টে পাস করতে পারি। </p>
            </div>
            <div className='question'>
                <h1>3.How useState Works?</h1>
                <p>Ans: useState হল একটি হুক যা আপনাকে ফাংশন কম্পোনেন্ট স্টেট ভেরিয়েবল রাখতে দেয়। আপনি এই ফাংশনে ইনিশিয়াল স্টেট পাস করতে পারেন এবং এটি বর্তমান অবস্থার মান (প্রাথমিক অবস্থা নয়) এবং এই মান আপডেট করার জন্য অন্য একটি ফাংশন সহ একটি ফাংশন প্রদান করে ।</p>
            </div>
        </div>
    );
};

export default Qustions;